{
    "1_Introduccion": {
        "name": "1_Introduccion",
        "video_urls": [],
        "long_description": {
            "intro": "En esta primera clase de Visión Artificial, analizaremos diversos aspectos consustanciales a la interpretación y manipulación de imágenes. Siendo innegable el papel de las imágenes y videos en la generación de grandes volúmenes de datos e información a nuestro alrededor, esta clase representa una necesidad imperante para cualquier científico de datos.",
            "temas": [
                "Conceptos básicos e introducción a la Visión Artificial",
                "Exploración de su funcionamiento y aplicaciones",
                "Técnicas de manipulación: Filtros gaussianos, detección de bordes, cambio de tamaño, recortes, agrupaciones y adición de figuras geométricas y textos",
                "Recorte, extracción y cambio de perspectiva de imágenes",
                "Introducción a la detección de rostros y aplicación del algoritmo Viola & Jones",
                "Uso de la tecnología OpenCV para la manipulación y análisis de videos y cámaras web."
            ],
            "outro": "Esta clase brindará a los estudiantes la habilidad práctica de manipular, interpretar y extraer información valiosa de imágenes y videos utilizando diversas técnicas y algoritmos. Los estudiantes también serán capaces de aplicar sus conocimientos para implementar soluciones de detección de rostros y entenderán los fundamentos del análisis de video y el manejo de cámaras web."
        },
        "ipynbs": {
            "Introduccion": "https://colab.research.google.com/drive/1cBYEVwc7qWCg3iWoWlS83xyzhpH4TO4U",
            "ejercicios": "https://colab.research.google.com/drive/1T04WYgFfZ7I4UW73gLf6oI0hy76MUYu7",
            "ejercicios_solucion": "https://colab.research.google.com/drive/1526SFX_w9URLd2EKV53ljzAY-8t5UWM0"
        },
        "materials": {}
    },
    "2_Convoluciones": {
        "name": "2_Convoluciones",
        "video_urls": [],
        "long_description": "",
        "ipynbs": {
            "Capas_Convolucionales": "https://colab.research.google.com/drive/1EQuiG6MIMh2CWLRm_mH_92XkGNL7OCSy",
            "ejercicios": "https://colab.research.google.com/drive/1GVOTOKc_bONsUzNhxAeM-tChgW6yHm83",
            "ejercicios_solucion": "https://colab.research.google.com/drive/1SWiy6Bm6vCp_vt6HiGCXtYPdZLPj00w4"
        },
        "materials": {}
    },
    "3_CNN_Modernas": {
        "name": "3_CNN_Modernas",
        "video_urls": [],
        "long_description": "",
        "ipynbs": {
            "1_Redes_Convolucionales": "https://colab.research.google.com/drive/17WvLakwc6bATq-jN_V7uihNYqsL7VE-9",
            "2_Transformers_Vision": "https://colab.research.google.com/drive/124fa2dLbHg_ox7TVeCVLipmfiX046BgN",
            "ejercicios": "https://colab.research.google.com/drive/1LZpH_T-TKCjH8Wmz3bQhH7WwtKLyfCsG",
            "ejercicios_solucion": "https://colab.research.google.com/drive/1n5tld2TcXhn4TbrcbFbBXsY6FolKtctr"
        },
        "materials": {}
    },
    "4_Transfer_Learning": {
        "name": "4_Transfer_Learning",
        "video_urls": [],
        "long_description": {
            "intro": "Esta clase se enfoca en la aplicación del Transfer Learning, que es una técnica de aprendizaje automático supervisado que utiliza modelos previamente entrenados en un dominio para aprender en otro dominio relacionado. Los detalles cubiertos ayudarán a los estudiantes a implementar técnicas de aprendizaje por transferencia para mejorar el rendimiento de sus modelos de aprendizaje de máquina y la comprensión de las características de las imágenes.",
            "temas": [
                "¿Qué es Transfer Learning y por qué es útil en el aprendizaje automático? ",
                "Uso de la biblioteca de Python para el aprendizaje por transferencia.",
                "Cómo cargar y modificar modelos preentrenados.",
                "Cómo definir e implementar la transferencia de estilo con Pytorch.",
                "Cómo optimizar una imagen para un estilo de imagen objetivo."
            ],
            "outro": "Tras esta clase, los estudiantes tendrán conocimientos prácticos para realizar la transferencia de estilo entre imágenes y mejorar la eficiencia y eficacia de sus modelos de aprendizaje automático. Esta clase también fomentará las habilidades de análisis y resolución de problemas en inteligencia artificial y aprendizaje de máquina."
        },
        "ipynbs": {
            "1_VisualizacionFeatures": "https://colab.research.google.com/drive/1QGHlZmeu5JdFXfzhCl23E2LYdSJmJUP_",
            "2_FineTuning": "https://colab.research.google.com/drive/1sqBzWg9o5MWkADFifg_xgXI0xx7Rb_sg",
            "3_TransferenciaEstilos": "https://colab.research.google.com/drive/18IuDyB3of9Z44CHxrPPzVYN-KWwkjL2d",
            "ejercicios": "https://colab.research.google.com/drive/1QDEjzA1YSo6O2XIrMTXZGueeMymppgBR",
            "ejercicios_solucion": "https://colab.research.google.com/drive/1Ss9eaAWgjnx_NR6t5IV2fNQ1xrOaqMVm"
        },
        "materials": {}
    },
    "5_Deteccion_Objetos": {
        "name": "5_Deteccion_Objetos",
        "video_urls": [],
        "long_description": "",
        "ipynbs": {
            "Deteccion_Objetos": "https://colab.research.google.com/drive/1XzeCv-zuc8hh4N9IOtjWkfWg0L-_hsLB",
            "ejercicios": "https://colab.research.google.com/drive/15X-kJhwPUTG-mRy1cvJGqhgXK6NWfo0_",
            "ejercicios_solucion": "https://colab.research.google.com/drive/12Fo1JMlDbdGmNhA7bS8yRKFSWaMCsLCO"
        },
        "materials": {}
    },
    "6_Segmentacion": {
        "name": "6_Segmentacion",
        "video_urls": [],
        "long_description": {
            "intro": "La clase 6 de programación en Python se centra en segmentación semántica: una técnica que divide una imagen en regiones que pertenecen a diferentes clases semánticas. Esta clase cubre cómo se diferencian la segmentación semántica, la segmentación de imágenes y la segmentación de instancias, utilizando el dataset de segmentación semántica Pascal VOC2012 y explicando la convolución transpuesta. Además, se explora la noción de Fully Convolutional Networks (FCN) y su aplicación en la segmentación.",
            "temas": [
                "Introducción a la segmentación semántica y cómo se diferencia de otras técnicas de segmentación",
                "Trabajo con el dataset de segmentación semántica Pascal VOC2012",
                "Entendimiento de la convolución transpuesta y su conexión con las matrices transpuestas",
                "Exploración de Fully Convolutional Networks (FCN)",
                "Aplicación de FCN en segmentación semántica",
                "Entrenamiento de FCN utilizando elementos de aprendizaje profundo",
                "Predicción utilizando FCN y evaluación de resultados"
            ],
            "outro": "Esta clase brinda las habilidades para entender y aplicar técnicas de segmentación semántica, trabajar con los datasets pertinentes y utilizar la convolución transpuesta. Se incrementará la comprensión de cómo se aplican las redes completamente convolucionales en la segmentación semántica, cómo entrenarlas y cómo evaluar su rendimiento."
        },
        "ipynbs": {
            "Segmentacion": "https://colab.research.google.com/drive/1494EYI2l6fdn6NC3yCgSjyiQMl17sCMw",
            "ejercicios": "https://colab.research.google.com/drive/1H0DIek61kgcVOlS774X9EsQnu_cb59F_",
            "ejercicios_solucion": "https://colab.research.google.com/drive/1Qv41hx97ET9__hhnq2J0fjEimb_4vmq3"
        },
        "materials": {}
    },
    "7_Modelos_Generativos": {
        "name": "7_Modelos_Generativos",
        "video_urls": [],
        "long_description": {
            "intro": "Esta es la séptima clase correspondiente al curso de Machine Learning donde se estudian los Modelos Generativos. Se ilustra cómo realizar la generación de contenido con Redes Generativas Adversarias (GANs) y se explica su uso en el proceso de la creación de imágenes.",
            "temas": [
                "Introducción a las Redes Generativas Adversarias (GANs).",
                "Diferencias entre aprendizaje discriminativo y modelado generativo.",
                "Arquitectura de las Redes Generativas Adversarias.",
                "Implementación de GANs para la generación de imágenes.",
                "Uso de Redes Generativas Adversarias Convolucionales Profundas (DCGANs).",
                "Trabajo con un set de datos de imágenes de jugadores de futbol.",
                "Aplicación del aprendizaje generativo en la generación de imágenes."
            ],
            "outro": "Esta clase permitirá a los estudiantes comprender y aplicar Redes Generativas Adversarias (GANs) y Redes Generativas Adversarias Convolucionales Profundas (DCGANs) para la generación de contenido. Desarrollarán habilidades para discriminar entre diferentes modelos de aprendizaje y saber cómo implementar cada uno."
        },
        "ipynbs": {
            "GANs": "https://colab.research.google.com/drive/1Ra6sPUnRhhycZjwy-THu81wjHLgTFTOu",
            "ejercicios": "https://colab.research.google.com/drive/1aBJW7-xkMi1g3ud7eH9V5kLi5H7mWLi0",
            "ejercicios_solucion": "https://colab.research.google.com/drive/1WwzFfhP9tPgyXKzpvOKPRTp__Y2wiTJr"
        },
        "materials": {}
    }
}