{
    "1_Procesamiento_Imagenes": {
        "name": "Procesamiento de Imágenes",
        "video_urls": [
            "https://www.youtube.com/embed/r-0JW35hII8"
        ],
        "long_description": {
            "intro": "Esta clase ofrece una mirada en profundidad al campo interdisciplinario de la Visión Artificial (Computer Vision), que se basa en obtener una comprensión de alto nivel a partir de imágenes o videos digitales. Descubre técnicas fundamentales de Procesamiento de Imágenes como detección de bordes, filtrado gaussiano y manipulaciones simples. Explora detalladamente cómo se organizan y manipulan las imágenes en Python y emplea la biblioteca OpenCV para tareas de Visión Artificial.",
            "temas": [
                "Introducción a Visión Artificial ",
                "Conceptos de manipulación de imágenes: filtros, detección de bordes y operaciones básicas",
                "Uso de OpenCV para completar tareas comunes de Visión Artificial",
                "Detección de caras utilizando el algoritmo de Violaa y Jones",
                "Tratamiento de archivos de vídeo y uso de la cámara web con OpenCV."
            ],
            "outro": "Esta clase proporciona habilidades fundamentales en Procesamiento de Imágenes y Visión Artificial, permitiendo a los estudiantes trabajar efectivamente con imágenes en Python usando OpenCV. Desarrollo de capacidades para implementar algoritmos de detección de caras y para manipular y analizar videos y transmisiones de cámara web."
        },
        "ipynbs": {
            "Introduccion": "https://colab.research.google.com/drive/1jTI2GGkLeUOvieO1HLIhgTI-iTYvXaK5",
            "ejercicios": "https://colab.research.google.com/drive/1GHHMv93369NG6GnS0VecBwrYHRp-PjGt",
            "ejercicios_solucion": "https://colab.research.google.com/drive/1WKnXuPqnL43E4tXEKb7-YwE6E7nym3qD"
        },
        "materials": {}
    },
    "2_Redes_Convolucionales": {
        "name": "Redes Convolucionales",
        "video_urls": [
            "https://www.youtube.com/embed/VuyRMzpxzxo"
        ],
        "long_description": "",
        "ipynbs": {
            "Capas_Convolucionales": "https://colab.research.google.com/drive/13A3EFcnoOHhYrMwQ7m74zEMdkiMZHGsI",
            "ejercicios": "https://colab.research.google.com/drive/1-FMDdSJzanbntLgekCLOnV64kze3Kl_w",
            "ejercicios_solucion": "https://colab.research.google.com/drive/1mCCmKSj4ld_PZOFO9tcAJhW6DZ2fZvdA"
        },
        "materials": {}
    },
    "3_Evolucion_Historica_CNN": {
        "name": "Evolución Histórica de las CNN",
        "video_urls": [
            "https://www.youtube.com/embed/wtHUh6ZxuU8",
            "https://www.youtube.com/embed/7iiRs_eaUMw",
            "https://www.youtube.com/embed/jiJfhCHukz0"
        ],
        "long_description": "",
        "ipynbs": {
            "1_Redes_Convolucionales": "https://colab.research.google.com/drive/1kEAzEtnxonLHdBXi33mddADvRF1nFrfB",
            "2_Transformers_Vision": "https://colab.research.google.com/drive/1-XJzWF3oue1o6a0qEgAwm5vHYmKTK85V",
            "ejercicios": "https://colab.research.google.com/drive/1kL_Hgx8h3N56EmZXgdwlrPZ80ATx2YlY",
            "ejercicios_solucion": "https://colab.research.google.com/drive/1ANgpcx2eKfmLn6LZyv3VlhRlrCSaqQbL"
        },
        "materials": {}
    },
    "4_Transfer_Learning": {
        "name": "Transfer Learning",
        "video_urls": [
            "https://www.youtube.com/embed/aLseNXuCcFM",
            "https://www.youtube.com/embed/Srdtt9eIlek"
        ],
        "long_description": {
            "intro": "En la clase 4 de Transfer Learning aprenderás cómo aplicar técnicas de aprendizaje transferido y realizar ajustes finos en tus modelos de Inteligencia Artificial. Esta clase cubre tanto los aspectos teóricos como prácticos de estas técnicas, utilizando Python y Jupyter Notebook para demostrar la implementación.",
            "temas": [
                "¿Qué es Transfer Learning y por qué es importante?",
                "Aplicando Transfer Learning: ejemplos prácticos.",
                "Reconocimiento de imágenes mediante ajuste fino.",
                "La técnica de Transferencia de Estilos en la IA.",
                "Visualización de las características aprendidas por ImageNet.",
                "Interpretabilidad de las Redes Neuronales a través de la visualización por ajuste.",
                "Cómo implementar la técnica de 'Fine-Tuning'."
            ],
            "outro": "Este curso proporcionará a los estudiantes una sólida base en el campo del aprendizaje transferido y les ayudará a aplicarlo en la práctica. Deberían ser capaces de evaluar cuándo el aprendizaje transferido es adecuado para sus tareas, cómo implementarlo y cómo interpretar los resultados del aprendizaje transferido."
        },
        "ipynbs": {
            "3_TransferenciaEstilos": "https://colab.research.google.com/drive/18IuDyB3of9Z44CHxrPPzVYN-KWwkjL2d",
            "1_VisualizacionFeatures": "https://colab.research.google.com/drive/1QGHlZmeu5JdFXfzhCl23E2LYdSJmJUP_",
            "2_FineTuning": "https://colab.research.google.com/drive/1sqBzWg9o5MWkADFifg_xgXI0xx7Rb_sg",
            "ejercicios": "https://colab.research.google.com/drive/1QDEjzA1YSo6O2XIrMTXZGueeMymppgBR",
            "ejercicios_solucion": "https://colab.research.google.com/drive/1Ss9eaAWgjnx_NR6t5IV2fNQ1xrOaqMVm"
        },
        "materials": {}
    },
    "5_Deteccion_Objetos": {
        "name": "Detección de Objetos",
        "video_urls": [
            "https://www.youtube.com/embed/J_8KsFSbsYo",
            "https://www.youtube.com/embed/_WZ4c-VsukA",
            "https://www.youtube.com/embed/GCZGRDy9thM"
        ],
        "long_description": {
            "intro": "En esta quinta clase del curso, nos adentraremos profundamente en la Detección Multibox de Disparo Único (SSD), uno de los modelos más utilizados y esenciales para la detección de objetos. Aprenderemos cómo esta técnica utiliza la detección de objetos a múltiples escalas para producir resultados efectivos y precisos. Exploraremos cómo utilizar en profundidad características como bounding boxes y anchor boxes, así como varias técnicas para mejorar la precisión y eficiencia del modelo.",
            "temas": [
                "Introducción a la Detección Multibox de Disparo Único (SSD).",
                "Comprensión de conceptos como bounding boxes y anchor boxes.",
                "Exploración del diseño y la implementación de SSD.",
                "Predicción de clases y bounding boxes.",
                "Concatenación de predicciones para múltiples escalas.",
                "Entrenamiento del modelo SSD en el conjunto de datos de detección de plátanos.",
                "Uso de las funciones de pérdida y evaluación en la detección de objetos.",
                "Aplicación de la supresión de no máximos para eliminar bounding boxes predichos similares.",
                "Mostrando bounding boxes predichas en la imagen de salida."
            ],
            "outro": "Al finalizar esta clase, serás capaz de implementar y aplicar eficientemente el modelo de Detección Multibox de Disparo Único (SSD) para la detección de objetos. Podrás trabajar en la optimización de este modelo a través de la predicción y evaluación de bounding boxes de varias escalas. Esta clase te permitirá aplicar técnicas avanzadas de inteligencia artificial y ciencia de datos en problemas de detección de objetos."
        },
        "ipynbs": {
            "3. SSD": "https://colab.research.google.com/drive/17cFvqaZ75pmisybPcOU6YcO-5kN6XnEU",
            "1. Detección de Objetos": "https://colab.research.google.com/drive/1GmmqN6Ul3SLUCRcneQORADoCEgemvyog",
            "2. AnchorBoxes": "https://colab.research.google.com/drive/1O5XW7AAMJVbcLWge1bo4LVffMMdDe27r",
            "ejercicios": "https://colab.research.google.com/drive/15X-kJhwPUTG-mRy1cvJGqhgXK6NWfo0_",
            "ejercicios_solucion": "https://colab.research.google.com/drive/12Fo1JMlDbdGmNhA7bS8yRKFSWaMCsLCO"
        },
        "materials": {}
    },
    "6_Segmentacion": {
        "name": "Segmentación",
        "video_urls": [
            "https://www.youtube.com/embed/0L3FSHNvU9A",
            "https://www.youtube.com/embed/96gc9MLXfis",
            "https://www.youtube.com/embed/wvS7siYe-h0"
        ],
        "long_description": {
            "intro": "En esta parte del curso vamos a explorar un tema muy avanzado en la rama de procesamiento de imágenes dentro del aprendizaje automático. Hablaremos sobre la segmentación semántica y cómo podemos realizarla utilizando el enfoque de Redes Completamente Convolucionales (FCN por sus siglas en inglés). Aprenderemos a utilizar Python y librerías como Pytorch para construir y entrenar estos modelos.",
            "temas": [
                "Segmentación Semántica: Delimitando instancias de diferentes clases a nivel pixel.",
                "Detección de objetos Vs Segmentación semántica.",
                "Dataset Pascal VOC2012.",
                "Convolución transpuesta y su uso para el \"upsampling\".",
                "El término erróneo de capas \"deconvolucional\".",
                "Fenómeno del aumento de dimensionalidad.",
                "Conexión entre la convolución y la matrix transpuesta.",
                "Introducción a las Redes Completamente Convolucionales (FCN).",
                "Entrenamiento y predicción con FCN."
            ],
            "outro": "En esta parte del curso, los estudiantes aprenderán sobre segmentación semántica y cómo se puede lograr utilizando redes convolucionales profundas. Tendrán la oportunidad de aplicar sus habilidades en Python y Pytorch en la implementación de estos modelos. También podrán entender y explicar conceptos clave como la convolución transpuesta y las FCN. Este conocimiento aumentará sus habilidades en el procesamiento de imágenes en el campo de la inteligencia artificial."
        },
        "ipynbs": {
            "Segmentacion": "https://colab.research.google.com/drive/1494EYI2l6fdn6NC3yCgSjyiQMl17sCMw",
            "ejercicios": "https://colab.research.google.com/drive/1H0DIek61kgcVOlS774X9EsQnu_cb59F_",
            "ejercicios_solucion": "https://colab.research.google.com/drive/1Qv41hx97ET9__hhnq2J0fjEimb_4vmq3"
        },
        "materials": {}
    },
    "7_Modelos_Generativos_No_Condicionados": {
        "name": "Modelos Generativos No Condicionados",
        "video_urls": [
            "https://www.youtube.com/embed/8PN6xiZOg74",
            "https://www.youtube.com/embed/hjvFyx0rgU0",
            "https://www.youtube.com/embed/Ox93HwtMgyQ"
        ],
        "long_description": {
            "intro": "En esta clase, exploraremos Modelos Generativos No Condicinados utilizando Python. Aprenderemos sobre Redes Generativas Adversarias, o GAN, que se utilizan para generar nuevos datos sintéticos que se parecen a un conjunto de entrenamiento dado. Nos centramos principalmente en la generación de imágenes, incluyendo prácticas con conjuntos de datos de imágenes y construcción de GAN desde cero.",
            "temas": [
                "Introducción a los Modelos Generativos No Condicinados y su importancia en la ciencia de datos.",
                "Explicación y uso de las Redes Generativas Adversarias (GAN).",
                "Generación de imágenes a partir de datos sintéticos creados.",
                "Construcción de GAN (Generador y Discriminador) desde cero en Python.",
                "Uso de Redes Generativas Adversarias Convolucionales Profundas (DCGAN), una variante de GAN, para generar imágenes.",
                "Entrenamiento de redes usando datos de imágenes existentes."
            ],
            "outro": "Esta clase es esencial para entender la teoría detrás de GAN y cómo implementar estas redes en Python. Obtendrás habilidades prácticas en la construcción de GAN y la generación de nuevos datos sintéticos a partir de un conjunto de entrenamiento dado. Al final del curso, los estudiantes estarán expuestos a prácticas avanzadas de generación y discriminación de imágenes basadas en GANs."
        },
        "ipynbs": {
            "GANs": "https://colab.research.google.com/drive/1LtzcYe3Y0Kpmr0shdGa88Eiock4-_593",
            "ModelosDeDifusión": "https://colab.research.google.com/drive/1bVqnBlbENjdmwxPjs34Jadp0TCLn8Oh4",
            "VAEs": "https://colab.research.google.com/drive/1x3xLDXFVmP98LKshUn1BNf22GNq63jw3",
            "ejercicios": "https://colab.research.google.com/drive/1LzGGh9ILB99Rm2ejY3TyLuMc7yJONtnu",
            "ejercicios_solucion": "https://colab.research.google.com/drive/1bY5TibCLswgnr0eFZH9PEZBs3SboMCOL"
        },
        "materials": {}
    },
    "8_Transformers_Vision": {
        "name": "Transformers Vision",
        "video_urls": [
            "https://www.youtube.com/embed/9M_Eva_fYB0",
            "https://www.youtube.com/embed/gTFare2t04w",
            "https://www.youtube.com/embed/Pqt7s_jsKos",
            "https://www.youtube.com/embed/dzs2AkCQrmY"
        ],
        "long_description": {
            "intro": "En esta clase, vamos a explorar el uso de transformers para visión (ViT) y su aplicación en la clasificación de imágenes. La arquitectura transformer, que inicialmente se propuso para el aprendizaje secuencia a secuencia, ha demostrado su eficiencia en diversas tareas del procesamiento del lenguaje natural. Esta clase pretende adaptarla para el modelamiento de datos de imagen.",
            "temas": [
                "Concepto de Transformers para Visión (ViT).",
                "Comparación de Convolucionales Neuronales y ViT.",
                "Introducción a los conceptos de sesgo inductivo.",
                "Traducción del flujo de tensores del modelo original de procesamiento de lenguaje natural a ViT.",
                "Introducción a la auto-atención y múltiple cabezal de atención.",
                "Codificación posicional.",
                "Conexiones residuales y normalización de capa.",
                "Entrenamiento de un ViT desde cero.",
                "Fine-tuning sobre un ViT pre-entrenado."
            ],
            "outro": "Esta clase busca mejorar la comprensión de los alumnos acerca de los transfomers y su aplicación en la visión por computadora. Desarrollarán la habilidad de entrenar ¡y realizar fine-tuning a un ViT utilizando datos de imágenes en Python. Este es un paso crítico para aplicar la técnica de transformers en el campo de la visión por computadora."
        },
        "ipynbs": {
            "Transformers_Vision": "https://colab.research.google.com/drive/1zeKJRRMm_6EDVgBWjTcIV4rauhc7LeZ1"
        },
        "materials": {}
    },
    "9_Imagenes_y_Lenguaje": {
        "name": "Imágenes y Lenguaje",
        "video_urls": [
            "https://www.youtube.com/embed/2QeO8yCyvoI",
            "https://www.youtube.com/embed/fYacAOF_A_U",
            "https://www.youtube.com/embed/6pcgtxvMXKk"
        ],
        "long_description": {
            "intro": "Aprenderás sobre el modelo CLIP de OpenAI y cómo puede ser implementado con Pytorch. Discutiremos su importancia en la comprensión de imágenes y lenguaje, las limitaciones de los enfoques tradicionales de Computer Vision, y cómo CLIP supera estas limitaciones a través de embeddings multimodales. Además, brindamos un tutorial sobre cómo entrenar el modelo CLIP utilizando el dataset flicker30k.",
            "temas": [
                "Importancia de los embeddings multimodales.",
                "Limitaciones de los enfoques de Computer Vision.",
                "Descripción del modelo CLIP de OpenAI.",
                "Implementación y entrenamiento de CLIP con Pytorch.",
                "Uso del modelo para la clasificación de imágenes."
            ],
            "outro": "Además de reforzar tus habilidades de Python, desarrollarás tu comprensión de los modelos de aprendizaje profundo como CLIP y su implementación práctica en Pytorch. También aprenderás sobre la importancia de los embeddings multimodales y cómo se pueden utilizar para la clasificación de imágenes."
        },
        "ipynbs": {
            "CLIP_ Imágenes y Lenguaje Natural": "https://colab.research.google.com/drive/1tFELXAqUe2wUrkvND3kJUWIkCCUsLcHf"
        },
        "materials": {}
    },
    "10_Modelos_Fundacionales": {
        "name": "Modelos Fundacionales",
        "video_urls": [
            "https://www.youtube.com/embed/1bQTRiheXow",
            "https://www.youtube.com/embed/UZ9PzFp6aVQ"
        ],
        "long_description": {},
        "ipynbs": {},
        "materials": {}
    }
}
