{
    "0":{
        "Question":"¿Cuál es el objetivo principal de la detección de objetos en imágenes?",
        "Answer 1":"Clasificar las imágenes en categorías predefinidas.",
        "Answer 2":"Convertir imágenes en escala de grises.",
        "Answer 3":"Reducir el tamaño de la imagen para su almacenamiento.",
        "Answer 4":"Identificar y localizar objetos dentro de la imagen.",
        "Correct answer(s)":"4"
    },
    "1":{
        "Question":"En el modelo SSD para detección de objetos, ¿qué representan las \"anchor boxes\"?",
        "Answer 1":"Filtros aplicados durante la convolución para detectar bordes.",
        "Answer 2":"Las clases a las que pertenecen los objetos en la imagen.",
        "Answer 3":"Cajas de referencia utilizadas para predecir la ubicación de los objetos.",
        "Answer 4":"Partes segmentadas de la imagen que se ignoran durante el entrenamiento.",
        "Correct answer(s)":"3"
    },
    "2":{
        "Question":"¿Qué técnica utiliza SSD para manejar objetos de diferentes tamaños?",
        "Answer 1":"Cambiar el tamaño de todas las imágenes a dimensiones fijas.",
        "Answer 2":"Utilizar mapas de características a múltiples escalas.",
        "Answer 3":"Aplicar filtros de desenfoque a las imágenes para reducir detalles.",
        "Answer 4":"Aumentar el número de capas en la red neuronal.",
        "Correct answer(s)":"2"
    },
    "3":{
        "Question":"Al implementar la capa de predicción de clases en SSD, ¿cuál es el propósito de utilizar una capa convolucional sin alterar el ancho o la altura de los mapas de características?",
        "Answer 1":"Mantener una correspondencia uno a uno entre las entradas y las salidas de las mismas dimensiones espaciales.",
        "Answer 2":"Aumentar la profundidad de los mapas de características para detectar más detalles.",
        "Answer 3":"Reducir el número de cálculos necesarios para la clasificación.",
        "Answer 4":"Fusionar diferentes mapas de características en una sola salida consolidada.",
        "Correct answer(s)":"1"
    },
    "4":{
        "Question":"¿Qué es la IoU (\"Intersección sobre Unión\") en el contexto de la detección de objetos?",
        "Answer 1":"Una métrica para calcular el error entre las predicciones del modelo y las anotaciones reales.",
        "Answer 2":"Una medida de la superposición entre las bounding boxes predichas y las verdaderas.",
        "Answer 3":"Un algoritmo para clasificar las categorías de objetos dentro de una imagen.",
        "Answer 4":"Una técnica para combinar múltiples modelos de detección de objetos y mejorar la precisión.",
        "Correct answer(s)":"2"
    },
    "5":{
        "Question":"En la detección de objetos, ¿qué método se utiliza para resolver el problema de las múltiples bounding boxes predichas para el mismo objeto?",
        "Answer 1":"Aumento de imágenes.",
        "Answer 2":"Supresión de no máximos (Non-Maximum Suppression, NMS).",
        "Answer 3":"Normalización de lotes.",
        "Answer 4":"Dropout.",
        "Correct answer(s)":"2"
    },
    "6":{
        "Question":"¿Qué papel juegan los \"down sampling blocks\" en el modelo SSD?",
        "Answer 1":"Aumentar la resolución de las imágenes de entrada.",
        "Answer 2":"Reducir la altura y el ancho de los mapas de características para detectar objetos a diferentes escalas.",
        "Answer 3":"Eliminar características irrelevantes de los datos de entrada.",
        "Answer 4":"Generar versiones ampliadas de las imágenes de entrada para mejorar la detección.",
        "Correct answer(s)":"2"
    },
    "7":{
        "Question":"¿Cómo se generan las \"anchor boxes\" de distintas formas en SSD?",
        "Answer 1":"Variando el número de capas en la red neuronal.",
        "Answer 2":"Aplicando transformaciones de rotación a las imágenes.",
        "Answer 3":"Utilizando combinaciones de diferentes escalas y relaciones de aspecto.",
        "Answer 4":"Cambiando aleatoriamente el tamaño de las imágenes durante el entrenamiento.",
        "Correct answer(s)":"3"
    },
    "8":{
        "Question":"¿Qué término describe mejor a las \"anchor boxes\" que no se asignan a una bounding box durante la fase de entrenamiento?",
        "Answer 1":"Anchor boxes activas.",
        "Answer 2":"Anchor boxes principales.",
        "Answer 3":"Anchor boxes negativas.",
        "Answer 4":"Anchor boxes de fondo.",
        "Correct answer(s)":"3"
    },
    "9":{
        "Question":"Durante el entrenamiento de un modelo SSD, ¿cómo se calcula la pérdida relacionada con las predicciones de las ubicaciones de los objetos?",
        "Answer 1":"Usando la pérdida de entropía cruzada.",
        "Answer 2":"Usando la pérdida de la norma $\\ell_1$ entre las predicciones y los valores verdaderos.",
        "Answer 3":"Aplicando la función de activación softmax.",
        "Answer 4":"Mediante el cálculo de la precisión y el recall.",
        "Correct answer(s)":"2"
    }
}