{
    "0":{
        "Question":"¿Qué es la Detección Multibox de Disparo Único (SSD)?",
        "Answer 1":"Un modelo de regresión de objetos.",
        "Answer 2":"Una técnica para segmentar imágenes.",
        "Answer 3":"Un modelo para detección de objetos.",
        "Answer 4":"Una técnica para clasificación de imágenes.",
        "Correct answer(s)":"3"
    },
    "1":{
        "Question":"¿Cómo se genera un anchor box en SSD?",
        "Answer 1":"Agregando alto y ancho a una ventana deslizante.",
        "Answer 2":"Prediciendo la clase y desplazamientos de una ventana deslizante.",
        "Answer 3":"Centrándolos en cada posición espacial de los mapas de características.",
        "Answer 4":"Ninguna de las anteriores.",
        "Correct answer(s)":"3"
    },
    "2":{
        "Question":"En la capa de predicción de bounding boxes, ¿cuál es la diferencia con la capa de predicción de clases?",
        "Answer 1":"Predice las clases de las bounding boxes.",
        "Answer 2":"Predice los cuatro desplazamientos en lugar de (\\( q+1 \\)) clases.",
        "Answer 3":"Predice las ubicaciones de las bounding boxes en lugar de la clase.",
        "Answer 4":"Todas las anteriores son correctas.",
        "Correct answer(s)":"2"
    },
    "3":{
        "Question":"¿Cómo se amplía el campo receptivo de cada unidad en los mapas de características de salida en un bloque de downsampling?",
        "Answer 1":"Aplicando una capa convolucional seguida de una capa max-pooling.",
        "Answer 2":"Aplicando solo una capa convolucional.",
        "Answer 3":"Aumentando la profundidad de la red.",
        "Answer 4":"Disminuyendo la profundidad de la red.",
        "Correct answer(s)":"1"
    },
    "4":{
        "Question":"¿Cómo se une la salida de predicción a diferentes escalas para una computación más eficiente?",
        "Answer 1":"Se apilan uno encima del otro.",
        "Answer 2":"Se transforman en un formato más consistente y se concatenan a lo largo de la dimensión 1.",
        "Answer 3":"Se suman juntos.",
        "Answer 4":"Se multiplican juntos.",
        "Correct answer(s)":"2"
    },
    "5":{
        "Question":"¿Cuál es el propósito del Bloque Base de la Red en el modelo de detección de objetos SSD?",
        "Answer 1":"Extraer características de las imágenes de entrada.",
        "Answer 2":"Ampliar el campo receptivo de cada unidad.",
        "Answer 3":"Generar mapas de características a diferentes escalas.",
        "Answer 4":"Calcular la pérdida de las bounding boxes.",
        "Correct answer(s)":"1"
    },
    "6":{
        "Question":"¿Qué tipo de pérdida se utiliza en el problema de regresión para la detección de objetos en el modelo SSD?",
        "Answer 1":"Pérdida de entropía cruzada.",
        "Answer 2":"Pérdida de la norma \\(\\ell_1\\).",
        "Answer 3":"Error cuadrático medio.",
        "Answer 4":"Pérdida de Hinge.",
        "Correct answer(s)":"2"
    },
    "7":{
        "Question":"¿Cómo se generan las bounding boxes en el modelo SSD?",
        "Answer 1":"Usando solo las clases predichas.",
        "Answer 2":"Usando solo los desplazamientos predichos.",
        "Answer 3":"Usando el tamaño de los mapas de características.",
        "Answer 4":"Usando los anchor boxes y sus desplazamientos predichos.",
        "Correct answer(s)":"4"
    },
    "8":{
        "Question":"¿Cuál declaración es correcta acerca de la supresión de no máximos en la detección de objetos?",
        "Answer 1":"Se usa para eliminar todas las bounding boxes.",
        "Answer 2":"Se usa para eliminar bounding boxes predichas similares.",
        "Answer 3":"Se usa para seleccionar un único objeto de interés.",
        "Answer 4":"Se usa para reducir la resolución de la imagen.",
        "Correct answer(s)":"2"
    },
    "9":{
        "Question":"¿Qué se muestra como salida en la predicción con el modelo SSD?",
        "Answer 1":"Todas las bounding boxes predichas.",
        "Answer 2":"Sólo la bounding box con mayor confianza.",
        "Answer 3":"Todas las bounding boxes predichas con una confianza de 0.9 o superior.",
        "Answer 4":"Ninguna de las anteriores.",
        "Correct answer(s)":"3"
    }
}