{
    "0":{
        "Question":"¿Cuál es el propósito del campo de la Visión Artificial?",
        "Answer 1":"Recrear imágenes digitales del mundo real",
        "Answer 2":"Manipular imágenes para crear arte",
        "Answer 3":"Hacer que las computadoras obtengan una comprensión de alto nivel a partir de imágenes o videos digitales",
        "Answer 4":"Desarrollar nuevos formatos de imagen",
        "Correct answer(s)":"3"
    },
    "1":{
        "Question":"¿Qué es un pixel en el contexto de una imagen digital?",
        "Answer 1":"La cantidad de luz que emite una imagen",
        "Answer 2":"Una línea de código que dibuja una imagen",
        "Answer 3":"Una unidad de medida para el tamaño de la imagen",
        "Answer 4":"La menor unidad homogénea en color que forma parte de una imagen digital",
        "Correct answer(s)":"4"
    },
    "2":{
        "Question":"¿Cuál es la función de cv2.cvtColor() en OpenCV?",
        "Answer 1":"Cambia el tamaño de una imagen",
        "Answer 2":"Aplica un filtro a una imagen",
        "Answer 3":"Cambia el espacio de colores de una imagen",
        "Answer 4":"Recorta una imagen",
        "Correct answer(s)":"3"
    },
    "3":{
        "Question":"¿Qué son los espacios de color?",
        "Answer 1":"Modelos matemáticos que describen la forma en que los colores pueden representarse",
        "Answer 2":"Espacios reservados en la memoria de la computadora para el almacenamiento de colores",
        "Answer 3":"Técnicas de codificación utilizadas para comprimir imágenes ",
        "Answer 4":"Unidades de medida para el brillo de los colores",
        "Correct answer(s)":"1"
    },
    "4":{
        "Question":"¿Cuál de los siguientes no es un tipo de espacio de color?",
        "Answer 1":"RGB",
        "Answer 2":"PST",
        "Answer 3":"HSV ",
        "Answer 4":"CMYK",
        "Correct answer(s)":"2"
    },
    "5":{
        "Question":"¿Qué implicaciones tiene la aplicación de un filtro gaussiano en una imagen?",
        "Answer 1":"Modifica la orientación de los colores en la imagen",
        "Answer 2":"Suaviza los bordes y reduce el ruido a cambio de una pérdida de nitidez",
        "Answer 3":"Aumenta el contraste de la imagen",
        "Answer 4":"Cambia la paleta de colores de la imagen",
        "Correct answer(s)":"2"
    },
    "6":{
        "Question":"¿Qué es el \"Bounding box\" en la localización de objetos?",
        "Answer 1":"Es el rectángulo que delimita la localización de un objeto en una imagen",
        "Answer 2":"Es un tipo de transformación aplicada a los objetos en una imagen",
        "Answer 3":"Es el espacio en el que se mueve un objeto en una imagen",
        "Answer 4":"Es el algoritmo que se utiliza para identificar objetos en una imagen",
        "Correct answer(s)":"1"
    },
    "7":{
        "Question":"¿Qué significa el término \"RGB\"?",
        "Answer 1":"Región de Grado Binario",
        "Answer 2":"Reconstrucción de Gráficos Binarios",
        "Answer 3":"Red Green Blue",
        "Answer 4":"Renderizado de Gráficos Bidimensionales",
        "Correct answer(s)":"3"
    },
    "8":{
        "Question":"¿Qué es una cascada en el contexto de los algoritmos de clasificación de imágenes?",
        "Answer 1":"Es un tipo de error que puede ocurrir durante la clasificación",
        "Answer 2":"Es una técnica de aprendizaje profundo",
        "Answer 3":"Es una serie de algoritmos de clasificación que se encadenan uno tras otro",
        "Answer 4":"Es un tipo de filtro que se aplica a la imagen antes de la clasificación",
        "Correct answer(s)":"3"
    },
    "9":{
        "Question":"¿Qué hace el método cv2.putText en OpenCV?",
        "Answer 1":"Inserta una subimagen en la imagen principal",
        "Answer 2":"Añade texto a la imagen",
        "Answer 3":"Modifica las propiedades del texto en la imagen",
        "Answer 4":"Traduce el texto de la imagen a diferentes idiomas",
        "Correct answer(s)":"2"
    }
}