{
    "0":{
        "Question":"¿Cómo funciona la segmentación semántica en las imágenes?",
        "Answer 1":"Reconoce y comprende los datos a nivel de filas.",
        "Answer 2":"Se usa para el etiquetado y predicción de regiones semánticas a nivel de píxel.",
        "Answer 3":"Se usa para el etiquetado y predicción de regiones semánticas a nivel de filas.",
        "Answer 4":"Reconoce y etiqueta objetos en las imágenes a nivel de píxel.",
        "Correct answer(s)":"4"
    },
    "1":{
        "Question":"La segmentación de instancias difiere de la segmentación semántica en que:",
        "Answer 1":"No distingue diferentes objetos.",
        "Answer 2":"Distingue no solo la semántica, sino también diferentes instancias de objetos.",
        "Answer 3":"Solo utiliza información de etiquetas de imagen durante el entrenamiento.",
        "Answer 4":"Todas las anteriores.",
        "Correct answer(s)":"3"
    },
    "2":{
        "Question":"Con respecto a la segmentación de imágenes:",
        "Answer 1":"No necesita información de etiqueta sobre los píxeles de la imagen durante el entrenamiento.",
        "Answer 2":"Garantiza que las regiones segmentadas tengan la semántica que esperamos obtener durante la predicción.",
        "Answer 3":"Ambas opciones son correctas.",
        "Answer 4":"Ninguna de las opciones es correcta.",
        "Correct answer(s)":"3"
    },
    "3":{
        "Question":"¿Qué son las Fully Convolutional Networks?",
        "Answer 1":"Redes que usan la CNN para transformar los píxeles de la imagen en atributos de imagen.",
        "Answer 2":"Redes que usan la CNN para transformar los píxeles de la imagen en clases de píxeles.",
        "Answer 3":"Redes que usan la CNN para clasificar las imágenes a nivel fila.",
        "Answer 4":"Ninguna de las anteriores.",
        "Correct answer(s)":"2"
    },
    "4":{
        "Question":"¿Cuáles son las capas convolucionales transpuestas?",
        "Answer 1":"Capas que están diseñadas para aumentar la altura y el ancho de los mapas de características.",
        "Answer 2":"Capas que están diseñadas para reducir la altura y ancho de los mapas de características.",
        "Answer 3":"Capas que están diseñadas para aumentar la altura y el ancho de las entradas.",
        "Answer 4":"Ambas opciones a y c son correctas.",
        "Correct answer(s)":"4"
    },
    "5":{
        "Question":"¿Para qué sirve la concatenación de la entrada en el modelo Fully Convolutional Network (FCN)?",
        "Answer 1":"La concatenación de la entrada se utiliza para categorizar las imágenes.",
        "Answer 2":"La concatenación de la entrada es previa a la capa de average pooling global.",
        "Answer 3":"La concatenación de la entrada se utiliza para mantener una correspondencia uno-a-uno entre las entradas y las capas de convolución.",
        "Answer 4":"Ninguna de las opciones es correcta.",
        "Correct answer(s)":"3"
    },
    "6":{
        "Question":"¿Cómo trabaja una convolución transpuesta con el padding y strides?",
        "Answer 1":"El padding se aplica a la entrada y el stride se aplica a los resultados intermedios.",
        "Answer 2":"El padding se aplica a la salida y el stride se aplica a los resultados intermedios.",
        "Answer 3":"El padding se aplica a los resultados intermedios y el stride se aplica a la salida.",
        "Answer 4":"El padding y el stride se aplican a la entrada.",
        "Correct answer(s)":"2"
    },
    "7":{
        "Question":"¿Cómo funciona la interpolación bilineal en el upscaling de imágenes?",
        "Answer 1":"Calcula el valor del píxel en la imagen de salida interpolando los cuatro píxeles más cercanos al píxel actual en la imagen de entrada.",
        "Answer 2":"Calcula el valor del píxel en la imagen de salida interpolando los cuatro píxeles más cercanos al píxel correspondiente a la misma posición en la imagen de entrada.",
        "Answer 3":"Calcula el valor del píxel en la imagen de salida interpolando los dos píxeles diagonales más próximos en la imagen de entrada.",
        "Answer 4":"Ninguna de las anteriores.",
        "Correct answer(s)":"2"
    },
    "8":{
        "Question":"¿Cuál es la principal diferencia entre la convolución transpuesta y la deconvolución?",
        "Answer 1":"La convolución transpuesta aumenta el tamaño de las imágenes, mientras que la deconvolución las reduce.",
        "Answer 2":"La convolución transpuesta es una técnica de upsampling, mientras que la deconvolución es de downsampling.",
        "Answer 3":"La convolución transpuesta solo invierte la convolución estándar en términos de dimensiones, pero la deconvolución también invierte los valores. ",
        "Answer 4":"No hay diferencia.",
        "Correct answer(s)":"3"
    }
}