{
    "0":{
        "Question":"¿Qué tipo de segmentación se enfoca en dividir la imagen en regiones pertenecientes a diferentes clases semánticas a nivel de píxel?",
        "Answer 1":"Segmentación de imágenes",
        "Answer 2":"Segmentación de instancias",
        "Answer 3":"Segmentación semántica",
        "Answer 4":"Clasificación de imágenes",
        "Correct answer(s)":"3"
    },
    "1":{
        "Question":"¿Cuál es la principal diferencia entre la segmentación de instancias y la segmentación semántica?",
        "Answer 1":"La segmentación semántica utiliza bounding boxes.",
        "Answer 2":"La segmentación de instancias se enfoca en la clasificación de imágenes.",
        "Answer 3":"La segmentación de instancias distingue diferentes instancias de objetos dentro de la misma clase.",
        "Answer 4":"La segmentación semántica no requiere etiquetas para entrenamiento.",
        "Correct answer(s)":"3"
    },
    "2":{
        "Question":"¿En qué conjunto de datos se basa el ejercicio de segmentación semántica presentado en la clase?",
        "Answer 1":"ImageNet",
        "Answer 2":"Pascal VOC2012",
        "Answer 3":"CIFAR-10",
        "Answer 4":"MNIST",
        "Correct answer(s)":"2"
    },
    "3":{
        "Question":"¿Qué método es comúnmente usado para el preprocesamiento de datos en segmentación semántica para evitar el cambio de escala inexacto de las regiones segmentadas?",
        "Answer 1":"Rotación",
        "Answer 2":"Normalización",
        "Answer 3":"Escala de grises",
        "Answer 4":"Recorte aleatorio",
        "Correct answer(s)":"4"
    },
    "4":{
        "Question":"En el contexto de redes neuronales para visión por computadora, ¿qué capa es utilizada para aumentar las dimensiones espaciales de los mapas de características?",
        "Answer 1":"Capa convolucional",
        "Answer 2":"Capa de agrupamiento (Pooling layer)",
        "Answer 3":"Capa de convolución transpuesta",
        "Answer 4":"Capa densa",
        "Correct answer(s)":"3"
    },
    "5":{
        "Question":"Para la convolución transpuesta, el padding se aplica a:",
        "Answer 1":"La entrada de la capa.",
        "Answer 2":"La salida de la capa.",
        "Answer 3":"El kernel.",
        "Answer 4":"Ninguna de las anteriores.",
        "Correct answer(s)":"2"
    },
    "6":{
        "Question":"En un Fully Convolutional Network (FCN) para segmentación semántica, el propósito principal de la convolución transpuesta es:",
        "Answer 1":"Reducir dimensiones",
        "Answer 2":"Extraer características",
        "Answer 3":"Clasificar imágenes",
        "Answer 4":"Aumentar las dimensiones espaciales de los mapas de características",
        "Correct answer(s)":"4"
    },
    "7":{
        "Question":"La inicialización de las capas convolucionales transpuestas en una FCN para segmentación semántica comúnmente emplea:",
        "Answer 1":"Inicialización de Xavier.",
        "Answer 2":"Inicialización aleatoria.",
        "Answer 3":"Upsampling de interpolación bilineal.",
        "Answer 4":"Inicialización de He.",
        "Correct answer(s)":"3"
    },
    "8":{
        "Question":"¿Qué técnica se utiliza comúnmente para entrenar una red totalmente convolucional (Fully Convolutional Network) para segmentación semántica?",
        "Answer 1":"Backpropagation estándar sin modificaciones.",
        "Answer 2":"Transferencia de aprendizaje únicamente.",
        "Answer 3":"Uso de una CNN preentrenada y modificación de las últimas capas.",
        "Answer 4":"Solo entrenamiento desde cero sin usar modelos preentrenados.",
        "Correct answer(s)":"3"
    },
    "9":{
        "Question":"Al realizar la predicción con una FCN en imágenes de tamaño variable para segmentación semántica, ¿qué técnica se suele aplicar para gestionar el cambio en las dimensiones de entrada?",
        "Answer 1":"Se estandariza el tamaño de todas las imágenes al más pequeño presente en el conjunto de datos.",
        "Answer 2":"Se recortan áreas que son múltiplos enteros de un determinado valor, cubriendo completamente la imagen de entrada.",
        "Answer 3":"Se aplica downsampling a todas las imágenes a un tamaño fijo antes de la predicción.",
        "Answer 4":"Se entrena un modelo separado para cada posible tamaño de imagen.",
        "Correct answer(s)":"2"
    }
}