{
    "0":{
        "Question":"¿Qué caracteriza principalmente a una Red Neuronal Convolucional (CNN) en comparación con una Red Neuronal de capas densas (MLP)?",
        "Answer 1":"Utiliza exclusivamente capas densas para procesar los datos.",
        "Answer 2":"Aprende patrones temporales en secuencias de datos.",
        "Answer 3":"Emplea operaciones de convolución, lo que la hace muy eficiente para tareas de procesamiento de imágenes.",
        "Answer 4":"No puede procesar datos con dimensiones espaciales, como imágenes.",
        "Correct answer(s)":"3"
    },
    "1":{
        "Question":"¿Qué representa el 'kernel' en una operación de convolución?",
        "Answer 1":"La función de activación que se aplica después de cada convolución.",
        "Answer 2":"Los pesos que se aplican sobre el vecindario de cada píxel de la entrada.",
        "Answer 3":"El tamaño de la salida generada después de aplicar la convolución.",
        "Answer 4":"El método de optimización utilizado para actualizar los pesos de la red.",
        "Correct answer(s)":"2"
    },
    "2":{
        "Question":"¿Qué efecto tiene aplicar *padding* en una operación de convolución?",
        "Answer 1":"Aumenta la velocidad de convergencia de la red al reducir el número de parámetros.",
        "Answer 2":"Permite controlar el tamaño espacial de la salida, usualmente para mantenerlo igual al tamaño de la entrada.",
        "Answer 3":"Reduce directamente el número de parámetros en el modelo, simplificándolo.",
        "Answer 4":"Incrementa la profundidad del canal de salida de la operación de convolución.",
        "Correct answer(s)":"2"
    },
    "3":{
        "Question":"¿Qué realiza una operación de *Max Pooling*?",
        "Answer 1":"Calcula el promedio de un grupo de píxeles, reduciendo la resolución espacial.",
        "Answer 2":"Suma todos los píxeles de la entrada, conservando la dimensión original.",
        "Answer 3":"Selecciona el valor máximo de un grupo de píxeles, reduciendo la resolución espacial.",
        "Answer 4":"Multiplica los valores de entrada por una matriz de pesos, transfiriendo datos a un espacio de mayor dimensión.",
        "Correct answer(s)":"3"
    },
    "4":{
        "Question":"¿Cuál es el propósito principal de utilizar funciones de activación no lineales en CNNs?",
        "Answer 1":"Reducir el tiempo necesario para entrenar la red.",
        "Answer 2":"Introducir no linealidades en la red que permitan modelar relaciones complejas.",
        "Answer 3":"Linealizar los datos de entrada para simplificar el proceso de aprendizaje.",
        "Answer 4":"Asegurar que la salida de la red sea siempre positiva.",
        "Correct answer(s)":"2"
    },
    "5":{
        "Question":"¿En qué se diferencian las capas *Fully Connected* (Densas) de las capas Convolucionales?",
        "Answer 1":"Las capas convolucionales no tienen parámetros, mientras que las capas densas sí.",
        "Answer 2":"Las capas convolucionales preservan la relación espacial entre píxeles, a diferencia de las capas densas que no.",
        "Answer 3":"Solo las capas convolucionales pueden procesar múltiples entradas a la vez.",
        "Answer 4":"Las capas densas son específicamente diseñadas para procesar imágenes, mientras que las convolucionales no.",
        "Correct answer(s)":"2"
    },
    "6":{
        "Question":"¿Qué rol juegan los canales en una imagen al utilizar CNNs?",
        "Answer 1":"Determinan el número de filtros que deben aplicarse en la primera capa convolucional.",
        "Answer 2":"Representan diferentes vistas de la entrada (por ejemplo, RGB en imágenes) que pueden ser procesadas por separado por los kernels.",
        "Answer 3":"Definen el tamaño máximo de los kernels que se pueden aplicar a la imagen.",
        "Answer 4":"Los canales son agregados después del entrenamiento para reducir la dimensionalidad de las imágenes.",
        "Correct answer(s)":"2"
    },
    "7":{
        "Question":"¿Cómo afecta el *stride* en una operación de convolución?",
        "Answer 1":"Modifica el número de canales en la salida de la operación de convolución.",
        "Answer 2":"Cambia la función de activación que se utiliza después de la convolución.",
        "Answer 3":"Controla el desplazamiento del kernel sobre la entrada, afectando el tamaño de la salida.",
        "Answer 4":"Determina la cantidad máxima de capas convolucionales que la red puede tener.",
        "Correct answer(s)":"3"
    },
    "8":{
        "Question":"Al incrementar el tamaño del kernel en una capa convolucional, ¿qué efecto tiene esto en la arquitectura de la red?",
        "Answer 1":"Reduce el número de parámetros de la red, simplificándola.",
        "Answer 2":"Aumenta el área de la entrada afectada por la convolución, potencialmente capturando características más generales.",
        "Answer 3":"Disminuye la profundidad necesaria de la red para alcanzar una precisión dada.",
        "Answer 4":"Limita la capacidad de la red para aprender funciones altamente no lineales.",
        "Correct answer(s)":"2"
    },
    "9":{
        "Question":"¿Cuál es un paso común necesario para preparar un conjunto de imágenes antes de entrenar una CNN?",
        "Answer 1":"Convertir todas las imágenes a vectores de características utilizando PCA.",
        "Answer 2":"Normalizar los valores de píxeles para tener rangos similares, generalmente entre 0 y 1.",
        "Answer 3":"Aplicar una transformación lineal a todas las imágenes para reducir sus dimensiones.",
        "Answer 4":"Ordenar las imágenes en el conjunto de datos según su similitud con las imágenes en el conjunto de prueba.",
        "Correct answer(s)":"2"
    }
}