{"1": {"Question": "¿Cuál es el propósito principal de las bounding boxes en la detección de objetos?", "Answer 1": "Ajustar el brillo y el contraste de una imagen.", "Answer 2": "Delimitar y localizar visualmente los objetos dentro de una imagen.", "Answer 3": "Convertir imágenes en blanco y negro a color.", "Answer 4": "Dividir una imagen en múltiples regiones.", "Correct answer(s)": "2"}, "2": {"Question": "¿Qué información suelen contener las bounding boxes en un conjunto de datos de detección de objetos?", "Answer 1": "El tamaño y la resolución de la imagen.", "Answer 2": "Las coordenadas de la esquina superior izquierda e inferior derecha del objeto.", "Answer 3": "El color y el tipo de objeto.", "Answer 4": "El nombre del archivo de imagen y su tamaño en bytes.", "Correct answer(s)": "2"}, "3": {"Question": "¿Cuál es una técnica común para evaluar la precisión de las bounding boxes en la detección de objetos?", "Answer 1": "Cálculo de la intersección sobre la unión (IoU) entre las bounding boxes predichas y las reales.", "Answer 2": "Ajuste del brillo y contraste de las imágenes.", "Answer 3": "Conversión de imágenes a escala de grises.", "Answer 4": "Aplicación de transformaciones geométricas a las imágenes.", "Correct answer(s)": "1"}, "4": {"Question": "¿Cuál es el propósito principal de los anchor boxes en la detección de objetos?", "Answer 1": "Ajustar el brillo y el contraste de una imagen.", "Answer 2": "Generar múltiples candidatos de bounding boxes con diferentes tamaños y proporciones alrededor de cada píxel.", "Answer 3": "Convertir imágenes en blanco y negro a color.", "Answer 4": "Dividir una imagen en múltiples regiones.", "Correct answer(s)": "2"}, "5": {"Question": "¿Por qué se utilizan diferentes tamaños y proporciones de anchor boxes en la detección de objetos?", "Answer 1": "Para reducir el tiempo de procesamiento de la imagen.", "Answer 2": "Para capturar objetos de diferentes escalas y formas dentro de la misma imagen.", "Answer 3": "Para mejorar la resolución de la imagen.", "Answer 4": "Para facilitar la conversión de imágenes a escala de grises.", "Correct answer(s)": "2"}, "6": {"Question": "¿Cuál es la función principal del algoritmo de supresión de no máximos (NMS) en la detección de objetos?", "Answer 1": "Ajustar el contraste de la imagen.", "Answer 2": "Eliminar bounding boxes redundantes que se superponen y conservar solo las más confiables.", "Answer 3": "Convertir imágenes en blanco y negro a color.", "Answer 4": "Dividir la imagen en regiones iguales.", "Correct answer(s)": "2"}, "7": {"Question": "¿Por qué es importante asignar correctamente los anchor boxes a las bounding boxes de ground-truth?", "Answer 1": "Para reducir el tamaño del modelo.", "Answer 2": "Para mejorar la velocidad de entrenamiento.", "Answer 3": "Para asegurar que las predicciones del modelo sean lo más precisas posible al tener correspondencias claras entre los objetos predichos y los reales.", "Answer 4": "Para facilitar la visualización de los resultados.", "Correct answer(s)": "3"}, "8": {"Question": "¿Cuál es la función principal de la red base (base_net) en el modelo SSD?", "Answer 1": "Realizar la clasificación final de los objetos.", "Answer 2": "Extraer características iniciales de la imagen a diferentes escalas.", "Answer 3": "Ajustar el brillo y el contraste de la imagen.", "Answer 4": "Dividir la imagen en regiones iguales.", "Correct answer(s)": "2"}, "9": {"Question": "¿Qué tarea realiza el bloque de predicción de bounding boxes (bbox_predictor) en el modelo SSD?", "Answer 1": "Predecir las coordenadas de las bounding boxes para cada anchor box.", "Answer 2": "Convertir imágenes en blanco y negro a color.", "Answer 3": "Mejorar la resolución de las imágenes.", "Answer 4": "Aplicar transformaciones geométricas a las imágenes.", "Correct answer(s)": "1"}, "10": {"Question": "¿Cuál es la función del bloque de predicción de clases (cls_predictor) en el modelo SSD?", "Answer 1": "Ajustar el tamaño de las imágenes.", "Answer 2": "Predecir la probabilidad de cada clase para cada anchor box.", "Answer 3": "Mejorar la calidad de las imágenes generadas.", "Answer 4": "Aplicar supresión de no máximos a las predicciones.", "Correct answer(s)": "2"}}