{
    "0":{
        "Question":"¿Qué caracteriza principalmente a los bloques residuales utilizados en ResNet?",
        "Answer 1":"Concatenan entradas y salidas en la dimensión del canal.",
        "Answer 2":"Utilizan un enfoque basado en la transformación lineal de la entrada.",
        "Answer 3":"Usan conexiones residuales para facilitar el entrenamiento de redes profundas.",
        "Answer 4":"Reducen el número de canales mediante convoluciones 1x1.",
        "Correct answer(s)":"3"
    },
    "1":{
        "Question":"¿Qué técnica utiliza DenseNet para manejar el flujo de información entre capas?",
        "Answer 1":"Suma las salidas de capas consecutivas.",
        "Answer 2":"Concatena las características de entrada y salida en cada capa.",
        "Answer 3":"Utiliza una convolución de tamaño variable en cada capa.",
        "Answer 4":"Aplica una normalización por lotes antes de cada bloque denso.",
        "Correct answer(s)":"2"
    },
    "2":{
        "Question":"En los Transformers para Visión (ViT), ¿cómo se tratan los parches de las imágenes para su procesamiento?",
        "Answer 1":"Se suman linealmente con un embedding posicional.",
        "Answer 2":"Se proyectan linealmente a un espacio de características y se suman con un embedding posicional.",
        "Answer 3":"Se convierten directamente en tokens sin proyección lineal.",
        "Answer 4":"Se aplican convoluciones densas antes de la proyección lineal.",
        "Correct answer(s)":"2"
    },
    "3":{
        "Question":"¿Qué activación utiliza el MLP del encoder Transformer de Visión que difiere del Transformer original?",
        "Answer 1":"Unidad lineal de error gaussiano (GELU).",
        "Answer 2":"Función de activación ReLU.",
        "Answer 3":"Función sigmoide.",
        "Answer 4":"Tanh hiperbólica.",
        "Correct answer(s)":"1"
    },
    "4":{
        "Question":"¿Cuál es una diferencia clave entre DenseNet y ResNet en términos de estructura de red?",
        "Answer 1":"DenseNet usa una función de activación diferente.",
        "Answer 2":"ResNet concatena características en lugar de sumarlas.",
        "Answer 3":"DenseNet concatena características en lugar de sumarlas.",
        "Answer 4":"ResNet no utiliza bloques densos.",
        "Correct answer(s)":"3"
    },
    "5":{
        "Question":"¿Para qué tipo de datos los Transformers de Visión (ViT) muestran su ventaja sobre ResNet cuando se entrenan modelos?",
        "Answer 1":"Datasets pequeños.",
        "Answer 2":"Imágenes a baja resolución.",
        "Answer 3":"Datasets grandes con modelos más grandes.",
        "Answer 4":"Datos con una estructura espacial simple.",
        "Correct answer(s)":"3"
    },
    "6":{
        "Question":"La normalización por lotes en los modelos CNN se usa para:",
        "Answer 1":"Acelerar la convergencia y actuar como regularización.",
        "Answer 2":"Reducir la cantidad de parámetros en el modelo.",
        "Answer 3":"Aumentar la profundidad del modelo sin aumentar el costo computacional.",
        "Answer 4":"Concatenar características de diferentes capas.",
        "Correct answer(s)":"1"
    },
    "7":{
        "Question":"¿Qué operación realiza la capa de transición en DenseNet?",
        "Answer 1":"Amplía el número de canales y reduce la resolución espacial.",
        "Answer 2":"Mantiene el número de canales y la resolución espacial.",
        "Answer 3":"Añade más bloques densos para aumentar la profundidad.",
        "Answer 4":"Reduce el número de canales y la resolución espacial.",
        "Correct answer(s)":"4"
    },
    "8":{
        "Question":"¿Qué problema trata de solucionar la inclusión del token \"cls\" en los Transformers de Visión (ViT)?",
        "Answer 1":"Aumentar el número de características disponibles para la clasificación.",
        "Answer 2":"Proporcionar una representación global para la tarea de clasificación.",
        "Answer 3":"Reducir la dimensionalidad de las características.",
        "Answer 4":"Actuar como un elemento regulador para evitar sobreajustes.",
        "Correct answer(s)":"2"
    },
    "9":{
        "Question":"En el contexto de la evolución de las CNNs, ¿qué aportaron las ResNets en comparación con modelos anteriores como AlexNet?",
        "Answer 1":"Una forma más eficaz de manejar datos de imagen de alta resolución.",
        "Answer 2":"Un número reducido de parámetros debido a convoluciones 1x1.",
        "Answer 3":"La capacidad de entrenar redes mucho más profundas sin sufrir degradación de rendimiento.",
        "Answer 4":"Un enfoque basado en la atención para interpretar relaciones espaciales complejas.",
        "Correct answer(s)":"3"
    }
}