{"1": {"Question": "¿Cuál es el objetivo principal de una GAN (Generative Adversarial Network)?", "Answer 1": "Generar datos sintéticos que sean indistinguibles de los datos reales.", "Answer 2": "Clasificar imágenes en diferentes categorías.", "Answer 3": "Reducir el ruido en las imágenes.", "Answer 4": "Convertir imágenes en blanco y negro a color.", "Correct answer(s)": "1"}, "2": {"Question": "¿Qué rol juega el discriminador en una GAN?", "Answer 1": "Generar nuevas imágenes a partir de ruido.", "Answer 2": "Distinguir entre datos reales y datos generados por el generador.", "Answer 3": "Ajustar el tamaño de las imágenes.", "Answer 4": "Mejorar la resolución de las imágenes generadas.", "Correct answer(s)": "2"}, "3": {"Question": "¿Cuál es el propósito del generador en una GAN?", "Answer 1": "Crear datos sintéticos a partir de una distribución latente.", "Answer 2": "Evaluar la calidad de los datos reales.", "Answer 3": "Reducir el ruido en las imágenes.", "Answer 4": "Dividir la imagen en regiones iguales.", "Correct answer(s)": "1"}, "4": {"Question": "¿Cuál es el propósito del espacio latente en un VAE (Variational Autoencoder)?", "Answer 1": "Ajustar el brillo y el contraste de una imagen.", "Answer 2": "Representar una compresión de los datos de entrada en una forma más compacta y continua que permita la generación de nuevos datos.", "Answer 3": "Dividir la imagen en regiones iguales.", "Answer 4": "Convertir imágenes en blanco y negro a color.", "Correct answer(s)": "2"}, "5": {"Question": "¿Qué papel juega la divergencia de Kullback-Leibler (KL) en el entrenamiento de un VAE?", "Answer 1": "Mejorar la resolución de las imágenes generadas.", "Answer 2": "Regularizar el espacio latente para que las distribuciones latentes aproximadas se asemejen a una distribución normal estándar.", "Answer 3": "Ayudar a clasificar imágenes en diferentes categorías.", "Answer 4": "Reducir el ruido en las imágenes.", "Correct answer(s)": "2"}, "6": {"Question": "¿Cuál es el término de reconstrucción en la función de pérdida de un VAE?", "Answer 1": "Ajustar el tamaño de las imágenes.", "Answer 2": "Medir la diferencia entre la imagen original y la imagen reconstruida por el decodificador.", "Answer 3": "Convertir imágenes en blanco y negro a color.", "Answer 4": "Aplicar transformaciones geométricas a las imágenes.", "Correct answer(s)": "2"}, "7": {"Question": "¿Por qué se considera que los VAEs tienen capacidades generativas superiores a los autoencoders tradicionales?", "Answer 1": "Porque usan redes neuronales más grandes.", "Answer 2": "Debido a la regularización del espacio latente que permite la generación de datos nuevos y realistas.", "Answer 3": "Porque utilizan más datos de entrenamiento.", "Answer 4": "Porque son más fáciles de entrenar.", "Correct answer(s)": "2"}, "8": {"Question": "¿Cuál es el objetivo principal de los modelos de difusión probabilística?", "Answer 1": "Clasificar imágenes en diferentes categorías.", "Answer 2": "Reducir el ruido en imágenes.", "Answer 3": "Generar datos sintéticos al aprender la distribución de los datos originales.", "Answer 4": "Convertir imágenes en blanco y negro a color.", "Correct answer(s)": "3"}, "9": {"Question": "¿Qué papel juega el ruido gaussiano en los modelos de difusión probabilística?", "Answer 1": "Se utiliza para perturbar las imágenes originales durante el proceso de difusión hacia adelante.", "Answer 2": "Mejora la resolución de las imágenes generadas.", "Answer 3": "Ayuda a clasificar imágenes en diferentes categorías.", "Answer 4": "Convierte imágenes en escala de grises a color.", "Correct answer(s)": "1"}, "10": {"Question": "¿Qué es la \"schedule de beta\" en el contexto de los modelos de difusión probabilística?", "Answer 1": "Un método para clasificar imágenes.", "Answer 2": "Una secuencia de valores que controla la cantidad de ruido añadido en cada paso de difusión.", "Answer 3": "Un algoritmo para reducir el tamaño de las imágenes.", "Answer 4": "Una técnica para mejorar la resolución de las imágenes.", "Correct answer(s)": "2"}}